CopyOfRolecall_To_Fusion/Files/RoleCall_FU/Fusion/Customer/MergeCustomerAccountSite/Request/mergeCustomerAccount.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<ns1:mergeCustomerAccount xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/">
<ns1:customerAccount xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/">
<ns2:CustomerAccountId>300000001771282</ns2:CustomerAccountId>
<ns2:RequestId>300000001771282</ns2:RequestId>
<ns2:CustomerAccountSite>
<ns2:PartySiteId>300000001771361</ns2:PartySiteId>
<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
<ns2:SetId>300000000003311</ns2:SetId>
<ns2:CustomerAccountSiteUse>
<ns2:SiteUseCode>BILL_TO</ns2:SiteUseCode>
<ns2:LocationId>300000001771359</ns2:LocationId>
<ns2:CreatedByModule>SIS</ns2:CreatedByModule>
<ns2:SetId>300000000003311</ns2:SetId>
</ns2:CustomerAccountSiteUse>
</ns2:CustomerAccountSite>
</ns1:customerAccount>
</ns1:mergeCustomerAccount>
</soap:Body>
</soap:Envelope>