DunningLetters/DunningLetters/Files/NS_FU/Fusion/MSSContactMerge/Request/SampleRequest.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/applicationModule/types/" xmlns:cus="http://xmlns.oracle.com/apps/cdm/foundation/parties/customerAccountService/" xmlns:cus1="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContactRole/" xmlns:par="http://xmlns.oracle.com/apps/cdm/foundation/parties/partyService/" xmlns:sour="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/sourceSystemRef/" xmlns:cus2="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountContact/" xmlns:cus3="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountRel/" xmlns:cus4="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSiteUse/" xmlns:cus5="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccountSite/" xmlns:cus6="http://xmlns.oracle.com/apps/cdm/foundation/parties/flex/custAccount/">
	<soapenv:Header/>
	<soapenv:Body>
		<typ:mergeCustomerAccount>
			<typ:customerAccount>
				<cus:RequestId>300000001771282</cus:RequestId>
				<cus:CustomerAccountId>300000003167502</cus:CustomerAccountId>
				<cus:PartyId>300000003167493</cus:PartyId>
				<cus:CustomerAccountContact>
					<cus:CustomerAccountId>300000003167502</cus:CustomerAccountId>
					<cus:PrimaryFlag>false</cus:PrimaryFlag>
					<cus:RoleType>CONTACT</cus:RoleType>
					<cus:CreatedByModule>SIS</cus:CreatedByModule>
					<cus:RelationshipId>300000003167543</cus:RelationshipId>
					<cus:CustomerAccountContactRole>
						<cus:ResponsibilityType>BILL_TO</cus:ResponsibilityType>
						<cus:PrimaryFlag>true</cus:PrimaryFlag>
						<cus:CreatedByModule>SIS</cus:CreatedByModule>
					</cus:CustomerAccountContactRole>
					<!--Zero or more repetitions:-->
				</cus:CustomerAccountContact>
			</typ:customerAccount>
		</typ:mergeCustomerAccount>
	</soapenv:Body>
</soapenv:Envelope>